cask_args appdir: '/Applications'

tap 'homebrew/bundle'
brew 'buildpacks/tap/pack'
brew 'dive'
brew 'go'
brew 'jq'
brew 'openssl'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'wget'
brew 'yarn'
brew 'awscli'
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-driver-xhyve'
brew 'lazydocker'
# brew 'jesseduffield/lazydocker/lazydocker'
# brew 'git'
brew 'kubernetes-cli'
#brew 'kubernetes-helm'
#brew 'kubetail'
#brew 'kubectl'
brew 'kubectx'
brew 'kube-ps1' # Adds current context and namespace in bash prompt
brew 'k9s'
brew 'neovim'
brew 'httpie'
#brew 'python3'
#brew 'terraform'
brew 'tmux'
# brew 'zsh'
#brew 'mosh'
#brew 'ctags'
brew 'fzf'
brew 'fd' # alternative to find
#brew 'homebrew/cask/android-platform-tools'
#brew 'iproute2mac'
#brew 'redis'
brew 'minikube'
brew 'pyenv'
# brew 'jenv'
# tap 'AdoptOpenJDK/openjdk'
# brew 'adoptopenjdk/openjdk/adoptopenjdk11'
brew 'pass'
brew 'gh'
brew 'switchaudio-osx' # Switch audio from alfred workflow
brew 'rustup' # rust, multiple versions

# PHP
brew 'composer'

# Font
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'
cask 'google-cloud-sdk'
# cask 'visual-studio-code'
# cask 'slack'
